joristork/robots/jobot_in_c/microchip_extras/h/p18f47j13.h
/*-------------------------------------------------------------------------
 * MPLAB-Cxx  PIC18F47J13 processor header
 *
 * (c) Copyright 1999-2010 Microchip Technology, All rights reserved
 *-------------------------------------------------------------------------*/

#ifndef __18F47J13_H
#define __18F47J13_H

extern volatile far  unsigned char       ADCTRIG;
extern volatile far  union {
  struct {
    unsigned TRIGSEL:2;
  };
  struct {
    unsigned SRC0:1;
    unsigned SRC1:1;
  };
  struct {
    unsigned TRIGSEL0:1;
    unsigned TRIGSEL1:1;
  };
  struct {
    unsigned SRC:2;
  };
} ADCTRIGbits;
extern volatile far  unsigned char       PD0;
extern volatile far  union {
  struct {
    unsigned ADCMD:1;
    unsigned SPI1MD:1;
    unsigned SPI2MD:1;
    unsigned UART1MD:1;
    unsigned UART2MD:1;
    unsigned ECCP1MD:1;
    unsigned ECCP2MD:1;
    unsigned ECCP3MD:1;
  };
  struct {
    unsigned :1;
    unsigned PMDMSSP1:1;
    unsigned PMDMSSP2:1;
    unsigned PMDUART1:1;
    unsigned PMDUART2:1;
    unsigned PMDECCP1:1;
    unsigned PMDECCP2:1;
    unsigned PMDECCP3:1;
  };
  struct {
    unsigned PMDADC:1;
    unsigned PMDMSSP:2;
    unsigned PMDUART:2;
    unsigned PMDECCP:3;
  };
  struct {
    unsigned :1;
    unsigned SPIMD:2;
    unsigned UARTMD:2;
    unsigned ECCPMD:3;
  };
} PD0bits;
extern volatile far  unsigned char       PMDIS0;
extern volatile far  union {
  struct {
    unsigned ADCMD:1;
    unsigned SPI1MD:1;
    unsigned SPI2MD:1;
    unsigned UART1MD:1;
    unsigned UART2MD:1;
    unsigned ECCP1MD:1;
    unsigned ECCP2MD:1;
    unsigned ECCP3MD:1;
  };
  struct {
    unsigned :1;
    unsigned PMDMSSP1:1;
    unsigned PMDMSSP2:1;
    unsigned PMDUART1:1;
    unsigned PMDUART2:1;
    unsigned PMDECCP1:1;
    unsigned PMDECCP2:1;
    unsigned PMDECCP3:1;
  };
  struct {
    unsigned PMDADC:1;
    unsigned PMDMSSP:2;
    unsigned PMDUART:2;
    unsigned PMDECCP:3;
  };
  struct {
    unsigned :1;
    unsigned SPIMD:2;
    unsigned UARTMD:2;
    unsigned ECCPMD:3;
  };
} PMDIS0bits;
extern volatile far  unsigned char       PD1;
extern volatile far  union {
  struct {
    unsigned :1;
    unsigned TMR1MD:1;
    unsigned TMR2MD:1;
    unsigned TMR3MD:1;
    unsigned TMR4MD:1;
    unsigned RTCCMD:1;
    unsigned CTMUMD:1;
    unsigned PSPMD:1;
  };
  struct {
    unsigned :1;
    unsigned PMDTMR1:1;
    unsigned PMDTMR2:1;
    unsigned PMDTMR3:1;
    unsigned PMDTMR4:1;
  };
  struct {
    unsigned :1;
    unsigned PMDTMR:4;
    unsigned PMDRTCC:1;
    unsigned PMDCTMU:1;
    unsigned PMDPSP:1;
  };
  struct {
    unsigned :1;
    unsigned TMRMD:4;
  };
} PD1bits;
extern volatile far  unsigned char       PMDIS1;
extern volatile far  union {
  struct {
    unsigned :1;
    unsigned TMR1MD:1;
    unsigned TMR2MD:1;
    unsigned TMR3MD:1;
    unsigned TMR4MD:1;
    unsigned RTCCMD:1;
    unsigned CTMUMD:1;
    unsigned PSPMD:1;
  };
  struct {
    unsigned :1;
    unsigned PMDTMR1:1;
    unsigned PMDTMR2:1;
    unsigned PMDTMR3:1;
    unsigned PMDTMR4:1;
  };
  struct {
    unsigned :1;
    unsigned PMDTMR:4;
    unsigned PMDRTCC:1;
    unsigned PMDCTMU:1;
    unsigned PMDPSP:1;
  };
  struct {
    unsigned :1;
    unsigned TMRMD:4;
  };
} PMDIS1bits;
extern volatile far  unsigned char       PD2;
extern volatile far  union {
  struct {
    unsigned CMP1MD:1;
    unsigned CMP2MD:1;
    unsigned CMP3MD:1;
    unsigned TMR5MD:1;
    unsigned TMR6MD:1;
    unsigned :1;
    unsigned TMR8MD:1;
  };
  struct {
    unsigned PMDCMP1:1;
    unsigned PMDCMP2:1;
    unsigned PMDCMP3:1;
  };
  struct {
    unsigned PMDCMP:3;
    unsigned PMDTMR5:1;
    unsigned PMDTMR6:1;
    unsigned :1;
    unsigned PMDTMR8:1;
  };
  struct {
    unsigned CMPMD:3;
  };
} PD2bits;
extern volatile far  unsigned char       PMDIS2;
extern volatile far  union {
  struct {
    unsigned CMP1MD:1;
    unsigned CMP2MD:1;
    unsigned CMP3MD:1;
    unsigned TMR5MD:1;
    unsigned TMR6MD:1;
    unsigned :1;
    unsigned TMR8MD:1;
  };
  struct {
    unsigned PMDCMP1:1;
    unsigned PMDCMP2:1;
    unsigned PMDCMP3:1;
  };
  struct {
    unsigned PMDCMP:3;
    unsigned PMDTMR5:1;
    unsigned PMDTMR6:1;
    unsigned :1;
    unsigned PMDTMR8:1;
  };
  struct {
    unsigned CMPMD:3;
  };
} PMDIS2bits;
extern volatile far  unsigned char       PD3;
extern volatile far  union {
  struct {
    unsigned :1;
    unsigned CCP4MD:1;
    unsigned CCP5MD:1;
    unsigned CCP6MD:1;
    unsigned CCP7MD:1;
    unsigned CCP8MD:1;
    unsigned CCP9MD:1;
    unsigned CCP10MD:1;
  };
  struct {
    unsigned :1;
    unsigned PMDCCP4:1;
    unsigned PMDCCP5:1;
    unsigned PMDCCP6:1;
    unsigned PMDCCP7:1;
    unsigned PMDCCP8:1;
    unsigned PMDCCP9:1;
    unsigned PMDCCP10:1;
  };
  struct {
    unsigned :1;
    unsigned PMDCCP:7;
  };
  struct {
    unsigned :1;
    unsigned CCPMD:7;
  };
} PD3bits;
extern volatile far  unsigned char       PMDIS3;
extern volatile far  union {
  struct {
    unsigned :1;
    unsigned CCP4MD:1;
    unsigned CCP5MD:1;
    unsigned CCP6MD:1;
    unsigned CCP7MD:1;
    unsigned CCP8MD:1;
    unsigned CCP9MD:1;
    unsigned CCP10MD:1;
  };
  struct {
    unsigned :1;
    unsigned PMDCCP4:1;
    unsigned PMDCCP5:1;
    unsigned PMDCCP6:1;
    unsigned PMDCCP7:1;
    unsigned PMDCCP8:1;
    unsigned PMDCCP9:1;
    unsigned PMDCCP10:1;
  };
  struct {
    unsigned :1;
    unsigned PMDCCP:7;
  };
  struct {
    unsigned :1;
    unsigned CCPMD:7;
  };
} PMDIS3bits;
extern volatile far  unsigned char       PPSCON;
extern volatile far  struct {
  unsigned IOLOCK:1;
} PPSCONbits;
extern volatile far  unsigned char       RPOR0;
extern volatile far  unsigned char       RPOR1;
extern volatile far  unsigned char       RPOR2;
extern volatile far  unsigned char       RPOR3;
extern volatile far  unsigned char       RPOR4;
extern volatile far  unsigned char       RPOR5;
extern volatile far  unsigned char       RPOR6;
extern volatile far  unsigned char       RPOR7;
extern volatile far  unsigned char       RPOR8;
extern volatile far  unsigned char       RPOR9;
extern volatile far  unsigned char       RPOR10;
extern volatile far  unsigned char       RPOR11;
extern volatile far  unsigned char       RPOR12;
extern volatile far  unsigned char       RPOR13;
extern volatile far  unsigned char       RPOR14;
extern volatile far  unsigned char       RPOR15;
extern volatile far  unsigned char       RPOR16;
extern volatile far  unsigned char       RPOR17;
extern volatile far  unsigned char       RPOR18;
extern volatile far  unsigned char       RPOR19;
extern volatile far  unsigned char       RPOR20;
extern volatile far  unsigned char       RPOR21;
extern volatile far  unsigned char       RPOR22;
extern volatile far  unsigned char       RPOR23;
extern volatile far  unsigned char       RPOR24;
extern volatile far  unsigned char       RPINR1;
extern volatile far  unsigned char       RPINR2;
extern volatile far  unsigned char       RPINR3;
extern volatile far  unsigned char       RPINR4;
extern volatile far  unsigned char       RPINR6;
extern volatile far  unsigned char       RPINR15;
extern volatile far  unsigned char       RPINR7;
extern volatile far  unsigned char       RPINR8;
extern volatile far  unsigned char       RPINR9;
extern volatile far  unsigned char       RPINR12;
extern volatile far  unsigned char       RPINR13;
extern volatile far  unsigned char       RPINR14;
extern volatile far  unsigned char       RPINR16;
extern volatile far  unsigned char       RPINR17;
extern volatile far  unsigned char       RPINR21;
extern volatile far  unsigned char       RPINR22;
extern volatile far  unsigned char       RPINR23;
extern volatile far  unsigned char       RPINR24;
extern volatile far  unsigned char       CCP10CON;
extern volatile far  union {
  struct {
    unsigned CCP10M:4;
    unsigned DC10B:2;
  };
  struct {
    unsigned CCP10M0:1;
    unsigned CCP10M1:1;
    unsigned CCP10M2:1;
    unsigned CCP10M3:1;
    unsigned DC10B0:1;
    unsigned DC10B1:1;
  };
} CCP10CONbits;
